package com.ohgiraffers.practice.chapter01_review.section02_variable;

public class Application03 {

    public static void main(String[] args) {

        // 수업목표. 변수의 명명 규칙에 대해 이해할 수 있다.
        /* 필기.
        *   변수의 명명 규칙
        *   1. 컴파일 에러를 발생시키는 규칙
        *       1-1. 동일한 범위 내에서 동일한 변수명을 가질 수 없다.
        *       1-2. 예약어는 사용이 불가능하다.
        *       1-3. 변수명은 대/소문자를 구분한다. (자바는 대/소문자를 엄격하게 구분하는 언어이다.)
        *       1-4. 변수명은 숫자로 시작할 수 없다. (시작만 할 수 없고 숫자를 섞어서 사용하는 것은 가능.
        *       1-5. 특수기호는 '_', '$'만 사용 가능하다.
        *  필기.
        *   2. 컴파일 에러를 발생시키지는 않지만 개발자들끼리의 암묵적인 규칙
        *       2-1. 변수명의 길이 제한은 없다. (하지만 적당히!)
        *       2-2. 변수명이 합성어인 경우, 첫 단어는 소문자, 두 번째 단어는 대문자로 시작한다.
        *       2-3. 단어와 단어 사이 연결을 언더스코어(_)로 하지 않는다. (타 언어 네이밍 규칙임)
        *       2-4. 한글로 변수명을 지을 순 있지만, 권장하지 않는다.
        *       2-5. 변수 안에 저장된 값의 의미를 명확하게 표현한다.
        *       2-6. 전형적인 변수 이름이 있다면 가급적 사용하도록.
        *       2-7. 명사형으로 작성할 수 있도록 한다.
        *       2-8. boolean 형은 의문문으로 가급적 긍정형 답이 나오도록 네이밍 한다.
        * */


    }

}
